export const Const = {
    Messages: {
        MQ00001: "MQ00001",
        MQ00002: "MQ00002",
        MQ00003: "MQ00003",
        MQ00004: "MQ00004",
        MQ00005: "MQ00005",
        MQ00006: "MQ00006",
        MQ00007: "MQ00007",
        MQ00008: "MQ00008",
        MQ00009: "MQ00009",
        MQ00010: "MQ00010",
        MQ00011: "MQ00011",
        MQ00012: "MQ00012",
        MQ00013: "MQ00013",
        MQ00014: "MQ00014",
        MQ00015: "MQ00015",
        MQ00016: "MQ00016",
        MQ00017: "MQ00017",
        MQ00018: "MQ00018",
        MQ00019: "MQ00019",
        MQ00020: "MQ00020",
        MQ00021: "MQ00021",
        MQ00022: "MQ00022",
        MQ00023: "MQ00023",
        MQ00024: "MQ00024",
        MQ00025: "MQ00025",
        MQ00026: "MQ00026",
        MQ00027: "MQ00027",
        MQ00028: "MQ00028",
        MQ00029: "MQ00029",
        MQ00030: "MQ00030",
        MQ00031: "MQ00031",
        MQ00032: "MQ00032",
        MQ00033: "MQ00033",
        MQ00034: "MQ00034",
        MQ00035: "MQ00035",
        MQ00036: "MQ00036",
        MQ00037: "MQ00037",
        MQ00038: "MQ00038",
        MQ00039: "MQ00039",
        MQ00040: "MQ00040",
        MQ00041: "MQ00041",
        MQ00042: "MQ00042",
        MQ00043: "MQ00043",
        MQ00044: "MQ00044",
        MQ00045: "MQ00045",
        MQ00063: "MQ00063",
        MQ00064: "MQ00064",
        MQ00066: "MQ00066",
        MQ00067: "MQ00067",
        MQ00068: "MQ00068"
    },

    CodeTypes: {
        TYPE_0001: "0001", // コード
        TYPE_0002: "0002", // 道府県（州）コード
        TYPE_0003: "0003", // 織タイプ
        TYPE_0004: "0004", // 場コード
        TYPE_0005: "0005", // 品種別
        TYPE_0006: "0006", // ンク
        TYPE_0007: "0007", // イレージ単位
        TYPE_0008: "0008", // 貨コード
        TYPE_0009: "0009", // 所タイプ
        TYPE_0010: "0010", // 語コード
        TYPE_0011: "0011", // ポート種別
        TYPE_0012: "0012", // ートタイプ
        TYPE_0013: "0013", // 業現場業種
        TYPE_0014: "0014", // 械アタッチメント
        TYPE_0015: "0015", // レームタイプ
        TYPE_0016: "0016", // 生区分
        TYPE_0017: "0017", // 定パターン
        TYPE_0018: "0018", // レームタイプ（エクセル取込用）
        TYPE_0019: "0019", // 入品種別
        TYPE_0020: "0020", // 権限
        TYPE_0021: "0021", // クニカルタイプ
        TYPE_0022: "0022", // 理票ステータス
        TYPE_0023: "0023", // 式分類
        TYPE_0024: "0024", // 了・未完了ステータス
        TYPE_0025: "0025", // 却方法
        TYPE_0026: "0026", // R返却先
        TYPE_0027: "0027", // 客様類別
        TYPE_0028: "0028", // 客様業種
        TYPE_0029: "0029", // 合他社
        TYPE_0030: "0030", // M機械管理状態
        TYPE_0031: "0031", // 理店機械管理状態
        TYPE_0032: "0032", // 00集計単位
        TYPE_0033: "0033", // ランティ種別
        TYPE_0034: "0034", // 検結果
        TYPE_0035: "0035", // 送費請求分類
        TYPE_0036: "0036", // 償修理タイプ
        TYPE_0037: "0037", // TR対象外理由
        TYPE_0038: "0038", // 具合時の機械状態
        TYPE_0039: "0039", // 理タイプ
        TYPE_0040: "0040", // ーザグループ
        TYPE_0041: "0041", // ーザ職制
        TYPE_0042: "0042", // ポートステータス
        TYPE_0043: "0043", // INCSチェック項目番号
        TYPE_0044: "0044", // INCSチェック項目番号 千葉
        TYPE_0045: "0045", // INCSチェック項目番号 唐山
        TYPE_0046: "0046", // INCSチェック項目番号 カラワン
        TYPE_0047: "0047", // ーザー権限
        TYPE_0048: "0048", // R返却棚
        TYPE_0049: "0049", // R返却受取区分
        TYPE_0050: "0050", // ポート閲覧検索期間タイプ
        TYPE_0051: "0051", // 処置
        TYPE_0052: "0052", // 判定区分
        TYPE_0053: "0053", // 械情報変更項目
        TYPE_0054: "0054", // タッチメント亀裂箇所
        TYPE_0055: "0055", // 書選択画面_レポートリスト
        TYPE_0056: "0056", // 品管処置
        TYPE_0057: "0057", // 信種別
        TYPE_0058: "0058", // ッセージタイプ
        TYPE_0059: "0059", // 起票パターン
        TYPE_0060: "0060", // 検結果リスト
        TYPE_0062: "0062", // 使用通貨レート
        TYPE_0066: "0066", // 症状
        TYPE_0068: "0068", // 中華人民共和国　市コード
        TYPE_0077: "0077", // ワランティ種別パターン
        TYPE_0078: "0078", // 仕向け地コード
        TYPE_0090: "0090", // 、県コード（LBX変換用）
        TYPE_0091: "0091", // Hエクセル取込オプション
        TYPE_0092: "0092", // Xエクセル取込オプション
        TYPE_0093: "0093", // 械アタッチメント変換用
        TYPE_0094: "0094", // 種変換用
        TYPE_0095: "0095"  // Xエクセルファイルパス
    },
    ReportType: {
        TYPE_010: "010",
        TYPE_020: "020",
        TYPE_030: "030",
        TYPE_040: "040",
        TYPE_050: "050",
        TYPE_055: "055",
        TYPE_060: "060",
        TYPE_065: "065",
        TYPE_070: "070",
        TYPE_080: "080",
        TYPE_090: "090",
        TYPE_100: "100",
        TYPE_110: "110",
        TYPE_120: "120",
        TYPE_130: "130"
    },
    Status: {
        status_01: "01",
        status_02: "02",
        status_03: "03",
        status_04: "04",
        status_99: "99"
    },
    MODE_TYPE_Y: "Y",    // 新規モード
    MODE_TYPE_N: "N",    // 変更モード
    TITLE: 'SKYDESK'
}
